["<h1>BILAL HAMEED|", "", "<h3>Email: bilalhameed248@gmail.com| Linkedin: /bilalhameed248|", "<h3>Cell: +92321 5233710| Github: github.com/bilalhameed248|", "", "<h2>E", "<h4>XPERIENCE|", "", "<h3>• MTBC CareCloud Inc.| Islamabad Pakistan| Jr. Data Scientist (Full-time)| Feb 2022 - Present|", "", "<h2>P", "<h4>ROJECTS|", "", "<h3>◦", "<p> Chart-Review Bot Document Parser API : Designed & Developed a generic Data Extraction end-to-end pipeline, for| Chart-review bot using complex (Plain + Tabular) Patient PDF document Charts. (PyMuPDF, Fitz, NLTK, Spacy, OOP,| Python-stack).| GitHub|", "<p>◦  Chart Review Bot : Designed & Developed Chart Review Bot - A Patient Charts Auditing System, which reads through the| patient appointment reports and assigns scores to component like (HPI, PLOF, Patient baseline-status etc) using natural| language processing. (Bio-BERT V1.1, RASA, Pytorch Spacy, NLTK, Fitz, Python Flask-backend).|", "<p>◦  Delay Reason Extraction Model : Developed Delay Reason Extraction Model, which analyze the document and extracts| the reason for Patient delay in Appointment (BERT, Tensorflow, HuggingFace Trainer API).| GitHub|", "<p>◦  Coding-bot : Developed CodingBot - A LSTM based DNN Bot, that parses NERs (Problems, Procedures and Medications)| from Patient HPI (History of Present Illness) text, and assign ICD-10, CPTs and RxNorm codes accordingly. (LSTM, DNN,| Spacy, NLTK, Pandas, Requests, Numpy, Python-stack, Flask-backend).| GitHub|", "<p>◦  Urdu to Eng Machine Translation : Developed Urdu to English machine translation model by fine tuning pre trained model| using huggingface trainer API. (Seq2Seq, Encoder Decoder, Huggingface Pipeline).| GitHub|", "<p>◦  News Classification Model : Developed News classification model by fine tuning pre-trained gpt2 and bert-base-cased.| (NLP, GPT2, TensorFlow, PyTorch, BERT, HuggingFace Trainer API).| GitHub-BERT-base-cased| GitHub-GPT2|", "", "<h3>• ConstRoot Systems Inc.| Islamabad Pakistan| Web Developer (Full-time)| Sep 2021 - Feb 2022|", "", "<h2>P", "<h4>ROJECTS|", "", "<h3>◦", "<p> ConstRoot : A construction management solution for general contractors based on Php Laravel, MySql, JQuery, Html and| CSS.| constroot.com|", "", "<h3>• ADMK Sokutions.| Islamabad Pakistan| Web Developer (Full-time)| Sep 2020 - Aug 2021|", "", "<h2>P", "<h4>ROJECTS|", "", "<h3>◦", "<p> NWSFD : Designed and developed a news website bot based on Php CodeIgniter, MySql, JQuery, Html and CSS.| nwsfd.com| GitHub| Bot Operation:|", "<p>∗  Open webmail/gmail through IMAP.| ∗  Create a list of news link by reading all unseen webmail/gmail from email body. (Job Scheduling)| ∗  Visit all news link recursively and fetch title descriptiona and image.| ∗  Store all data in db and display it on frontend.|", "<p>◦  Schools Management System : Designed and developed school management system for KSA based on Php Laravel,| MySql, JQuery, Html and CSS| GitHub|", "<p>◦  Newface : Designed and developed Web based Job Portal using Php Codeigniter, MySql, JQuery, Html and CSS.| newface.mk| GitHub|", "", "<h2>S", "<h4>KILLS", "<h2> S", "<h4>UMMARY|", "", "<h3>•", "<p> Deep Learning and NLP : PyTorch, TensorFlow, Keras, CNN, RNN, LSTM, GRU, Transformers, BERT, Spacy, Gensim.|", "<p>•  Machine Learning : Classification, Regression, Clustering, PCA, Ensemble methods (Bagging, Boosting etc).|", "<p>•  Languages : Python, PHP, C++, JavaScript, SQL, Bash, JAVA.|", "<p>•  Frameworks : Django, Flask, Scikit, NLTK, SpaCy, TensorFlow, Keras, Laravel, Java Swing, Java Fx.|", "<p>•  Tools/IDEs : Vim, VSCode, Jupyter Notebook, GIT, PostgreSQL, MySQL, SQLite|", "<p>•  Version Control : Git, Jira, Azure|", "<p>•  OS : Linux, Ubuntu, Windows.|", "<p>•  Frontend Technologies : HTML, CSS, Jquery.|", "", "<h2>C", "<h4>ERTIFICATION|", "", "<h3>• IBM Data Science Professional Certificate| July 2021 - Sep 2021|", "", "<h2>E", "<h4>DUCATION|", "", "<h3>• BS Computer Science (International Islamic University Islamabad)| GPA: 3.59| July 2016 - June 2020|"]